In [ ]:
import pandas as pd

In [ ]:
path = ("C:/Users/ASUS/Documents/Project/Momo case study/Data/raw/momo_top_up.xlsx")

In [ ]:
df_transactions = pd.read_excel(path, sheet_name=0)
df_user_info = pd.read_excel(path, sheet_name=2)
df_commision = pd.read_excel(path, sheet_name= 1)

# Transactions

In [ ]:
print("Kích thước của df Transactions")
print(df_transactions.shape)

Kích thước của df Transactions
(13495, 6)

In [ ]:
print("Thông tin của dataframe transactions")
df_transactions.info()
print("-----------------------")

Thông tin của dataframe transactions
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13495 entries, 0 to 13494
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   user_id          13495 non-null  int64
 1   order_id         13495 non-null  int64
 2   Date             13495 non-null  object
 3   Amount           13495 non-null  object
 4   Merchant_id      13495 non-null  int64
 5   Purchase_status  2235 non-null   object
dtypes: int64(3), object(3)
memory usage: 632.7+ KB
-----------------------

In [ ]:
df_transactions.head(3)

    user_id    order_id        Date  Amount  Merchant_id Purchase_status
0  21269588  4169517626  2020-01-01  10,000           13             NaN
1  28097592  4170276686  2020-01-01  20,000           13             NaN
2  47435144  4166729310  2020-01-01  10,000           12             NaN

In [ ]:
df_transactions.tail(3)

        user_id    order_id        Date  Amount  Merchant_id Purchase_status
13492  46156488  8717515352  2020-12-31  20,000           12             NaN
13493  35858614  8716668316  2020-12-31  10,000           12             NaN
13494  49335467  8710511927  2020-12-31  10,000           12             NaN

# User_info

In [ ]:
print("Kích thước của df User_info")
print(df_user_info.shape)

Kích thước của df User_info
(13428, 5)

In [ ]:
print("Thông tin của dataframe user_info")
df_user_info.info()
print("-----------------------")

Thông tin của dataframe user_info
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13428 entries, 0 to 13427
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User_id          13428 non-null  int64
 1   First_tran_date  13428 non-null  object
 2   Location         13428 non-null  object
 3   Age              13428 non-null  object
 4   Gender           13428 non-null  object
dtypes: int64(1), object(4)
memory usage: 524.7+ KB
-----------------------

In [ ]:
df_user_info.head(3)

    User_id First_tran_date      Location       Age Gender
0  41654498      2018-05-02          HCMC  33_to_37   MALE
1  51276281      2019-12-08  Other Cities   unknown   MALE
2  49152375      2019-12-20  Other Cities  23_to_27   MALE

In [ ]:
df_user_info.tail(3)

        User_id First_tran_date      Location       Age Gender
13425  46334970      2019-04-23  Other Cities   unknown   male
13426  50760533      2019-11-13  Other Cities  18_to_22     Nữ
13427  44818205      2019-03-05          HCMC  18_to_22    Nam

# EDA